//=============================================================================
// Graphics
//-----------------------------------------------------------------------------
/**
    @page modules1_graphics1 

    - @ref modules1_graphics1_anchor1   "xxxx"
    <br>
    
    @if DOXY_COMMENT --------------------------------------------------- @endif
    <hr>
    @anchor modules1_graphics1_anchor1
    @par xxxx
    <br>
    @if DOXY_COMMENT --------------------------------------------------- @endif
MEMO:フォントの Set 系 (SetName() 等) を頻繁に呼び出すとパフォーマンスが落ちる可能性があります。<br>
    デフォルトのフォントは MS Pゴシック が選択されますが、
    
    <br>
    <br>
*/
//=============================================================================