//==============================================================================
// UIElement 
//==============================================================================

#include "stdafx.h"
#include "UIElement.h"

namespace LNote
{
namespace Core
{
namespace GUI
{

//==============================================================================
// UIElement
//==============================================================================

Property*	UIElement::WidthProperty = NULL;
Property*	UIElement::HeightProperty = NULL;

//--------------------------------------------------------------------------
//
//--------------------------------------------------------------------------
UIElement::UIElement()
{
}

//--------------------------------------------------------------------------
//
//--------------------------------------------------------------------------
UIElement::~UIElement()
{
}

//--------------------------------------------------------------------------
//
//--------------------------------------------------------------------------
void UIElement::beginAnimation(Property* targetProp, AnimationTimeline* timeline)
{
	LN_THROW_NotImpl(0);
}

//--------------------------------------------------------------------------
//
//--------------------------------------------------------------------------
void UIElement::measure(LSize availableSize)
{
	// 親要素から子要素を配置できる範囲(availableSize)を受け取り、DesiredSize を更新する。
	// ① Pane ―[measure()   … この範囲内なら配置できるよ]→ Button
	// ② Pane ←[DesiredSize … じゃあこのサイズでお願いします]― Button
	// ③ Pane ―[arrange()   … 他の子要素との兼ね合いで最終サイズはコレで]→ Button
	// http://www.kanazawa-net.ne.jp/~pmansato/wpf/wpf_ctrl_arrange.htm
	LN_THROW_NotImpl(0);
}

//--------------------------------------------------------------------------
//
//--------------------------------------------------------------------------
void UIElement::arrange(LRect finalRect)
{
	LN_THROW_NotImpl(0);
}

//--------------------------------------------------------------------------
//
//--------------------------------------------------------------------------
void UIElement::updateFrame(float elapsedTime)
{
	LN_THROW_NotImpl(0);
}

} // namespace GUI
} // namespace Core
} // namespace LNote
